//{{ВКМ. Устанавливаем видимость реквизита ВКМ_ПроцентЗаВыполненныеРаботы в зависимости от 
//категории сотрудника
&НаКлиенте
Процедура ВКМ_ПодразделениеПриИзменении(Элемент)
	Если Строка(Запись.ВКМ_Подразделение) = "Административный персонал" Тогда
		Элементы.ВКМ_ПроцентПремии.Видимость = Ложь;
	Иначе 
		Элементы.ВКМ_ПроцентПремии.Видимость = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Строка(Запись.ВКМ_Подразделение) = "Административный персонал" Тогда
		Элементы.ВКМ_ПроцентПремии.Видимость = Ложь;
	Иначе 
		Элементы.ВКМ_ПроцентПремии.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
	//}}ВКМ. 
