
//{{ВКМ: Устанавливаем видимость Реквизитов договора абонентского обслуживания
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;       
	КонецЕсли;
	
КонецПроцедуры 
//}}ВКМ

//{{ВКМ: Меняем видимость реквизитов в зачисимости от выбранного вида договора 
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
    
    Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
        Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
        Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина; 
    Иначе 
        Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
        Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
        
        Объект.ВКМ_НачалоДействияДоговора = Неопределено;
        Объект.ВКМ_ОкончаниеДействияДоговора = Неопределено;
        Объект.ВКМ_СуммаАбонентскойПлаты = Неопределено;
        Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
    КонецЕсли;   
    
КонецПроцедуры
//}}ВКМ

