//{{ВКМ. Обработка проведения документа Начисление фиксированной премии 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//{{ВКМ. Регистр расчета ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	ВКМ_СформироватьДвижения();
	ВКМ_РассчитатьФиксированнуюПремию();
	ВКМ_РассчитатьПремиюЗаРаботу();
	//}}ВКМ.
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

Процедура ВКМ_СформироватьДвижения()
	
	ВКМ_СформироватьДвиженияДополнительныеНачисления();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры      

Процедура ВКМ_СформироватьДвиженияДополнительныеНачисления()
	
	Для Каждого Строка Из ВКМ_Начисления Цикл 
		Если ТипЗнч(Строка.ВКМ_ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Продолжить;
		КонецЕсли; 
		
		//{{ВКМ. Регистр ВКМ_ДополнительныеНачисления
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = Строка.ВКМ_ВидРасчета;
		Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.ВКМ_Подразделение = Строка.ВКМ_Подразделение;
		
		Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия Тогда
			Движение.БазовыйПериодНачало = Строка.ВКМ_ДатаНачала;
			Движение.БазовыйПериодКонец = Строка.ВКМ_ДатаОкончания;
		КонецЕсли;	
		
		Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия Тогда
			Движение.БазовыйПериодНачало = Строка.ВКМ_ДатаНачала;
			Движение.БазовыйПериодКонец = Строка.ВКМ_ДатаОкончания;
		КонецЕсли;	
		//}}ВКМ. 
		
		//{{ВКМ. Регистр ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.ВКМ_Подразделение = Строка.ВКМ_Подразделение;
		
		Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия Тогда
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ФиксированнаяПремия; 
		КонецЕсли;
		
		Если Строка.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия Тогда
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Премия; 
		КонецЕсли;
		//}}ВКМ. 
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ВКМ_РассчитатьФиксированнуюПремию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_РезультатБаза, 0) КАК РезультатБаза,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентФиксПремии, 0) КАК ПроцентПремии,
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления.БазаВКМ_ОсновныеНачисления(
	|			&Измерения,
	|			&Измерения,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &Премия) КАК ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Период,
	|				(ВКМ_Сотрудник, ВКМ_Подразделение) В
	|					(ВЫБРАТЬ
	|						ДополнительныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|						ДополнительныеНачисления.ВКМ_Подразделение КАК Подразделение
	|					ИЗ
	|						РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ДополнительныеНачисления
	|					ГДЕ
	|						ДополнительныеНачисления.Регистратор = &Ссылка
	|						И ДополнительныеНачисления.ВидРасчета = &Премия)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
	|			И ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Подразделение = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Подразделение";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));  
	
	Измерения = Новый Массив;
	Измерения.Добавить("ВКМ_Подразделение");
	Измерения.Добавить("ВКМ_Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//{{ВКМ. Регистр расчета ВКМ_ДополнительныеНачисления
		Движение = Движения.ВКМ_ДополнительныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];	
		Результат = ВыборкаДетальныеЗаписи.РезультатБаза * ВыборкаДетальныеЗаписи.ПроцентПремии / 100;
		Движение.ВКМ_Результат = Результат;
		РезультатБезНДФЛ = Результат - (Результат * 0.13);
		Движение.ВКМ_РезультатБезНДФЛ = РезультатБезНДФЛ;
		Движение.ВКМ_Показатель = ВыборкаДетальныеЗаписи.ПроцентПремии;
		//}}ВКМ
		
		//{{ВКМ. Регистр расчета ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];	
		Движение.ВКМ_Результат = Результат - РезультатБезНДФЛ;
		//}}ВКМ
		
		//{{ВКМ. Регистр накоплений ВКМ_ВзаиморасчетыССотрудниками Приход
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;  
		Движение.ВКМ_ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ВКМ_Сумма = РезультатБезНДФЛ;
		//}}ВКМ.
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры

Процедура ВКМ_РассчитатьПремиюЗаРаботу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_РезультатБаза, 0) КАК РезультатБаза,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентПремии, 0) КАК ПроцентПремии,
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления.БазаВКМ_ОсновныеНачисления(
	|			&Измерения,
	|			&Измерения,
	|			,
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &Премия) КАК ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Период,
	|				(ВКМ_Сотрудник, ВКМ_Подразделение) В
	|					(ВЫБРАТЬ
	|						ДополнительныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|						ДополнительныеНачисления.ВКМ_Подразделение КАК Подразделение
	|					ИЗ
	|						РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ДополнительныеНачисления
	|					ГДЕ
	|						ДополнительныеНачисления.Регистратор = &Ссылка
	|						И ДополнительныеНачисления.ВидРасчета = &Премия)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник
	|			И ВКМ_ДополнительныеНачисленияБазаВКМ_ОсновныеНачисления.ВКМ_Подразделение = ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Подразделение";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));  
	
	Измерения = Новый Массив;
	Измерения.Добавить("ВКМ_Подразделение");
	Измерения.Добавить("ВКМ_Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//{{ВКМ. Регистр расчета ВКМ_ДополнительныеНачисления
		Движение = Движения.ВКМ_ДополнительныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];	
		Результат = ВыборкаДетальныеЗаписи.РезультатБаза * ВыборкаДетальныеЗаписи.ПроцентПремии / 100;
		Движение.ВКМ_Результат = Результат;
		РезультатБезНДФЛ = Результат - (Результат * 0.13);
		Движение.ВКМ_РезультатБезНДФЛ = РезультатБезНДФЛ;
		Движение.ВКМ_Показатель = ВыборкаДетальныеЗаписи.ПроцентПремии;
		//}}ВКМ 
		
		//{{ВКМ. Регистр расчета ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];	
		Движение.ВКМ_Результат = Результат - РезультатБезНДФЛ;
		//}}ВКМ
		
		//{{ВКМ. Регистр накоплений ВКМ_ВзаиморасчетыССотрудниками Приход
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;  
		Движение.ВКМ_ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ВКМ_Сумма = РезультатБезНДФЛ;
		//}}ВКМ.
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры
//}}ВКМ. Обработка проведения документа Начисление фиксированной премии 
