//{{ВКМ. Длительная операция
Процедура  ВыполнитьТяжелыйКод(ДатаНачала, ВидДоговора) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ДоговорыКонтрагентов.Ссылка КАК Ссылка,
    |   ДоговорыКонтрагентов.Владелец КАК Владелец,
    |   ДоговорыКонтрагентов.Наименование КАК Наименование,
    |   ДоговорыКонтрагентов.Организация КАК Организация,
    |   ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
    |   ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
    |   ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
    |   ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
    |   ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
    |ИЗ
    |   Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |   ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
    |   И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ВКМ_НачалоДействияДоговора
    |   И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ВКМ_НачалоДействияДоговора";
    
    
    Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
    Запрос.УстановитьПараметр("ВКМ_НачалоДействияДоговора", ДатаНачала);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        ОбщегоНазначения.СообщитьПользователю("За указанный период нет договоров абонентского обслуживания.");
        Возврат;
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
    
    КоличествоНайденныхДокументов = ВыборкаДетальныеЗаписи.Количество();
    ТекДок = 1;
    
     Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
         
        ДокументРеализация = Документы.РеализацияТоваровУслуг.НайтиПоРеквизиту("Договор", ВыборкаДетальныеЗаписи.Ссылка);
        
        Если ДокументРеализация.Номер = "" Тогда 
            НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            НоваяРеализация.Дата = ТекущаяДата();
            НоваяРеализация.Организация = ВыборкаДетальныеЗаписи.Организация;
            НоваяРеализация.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
            НоваяРеализация.Договор = ВыборкаДетальныеЗаписи.Ссылка;
            НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение(ВыборкаДетальныеЗаписи.Ссылка); 
            НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение); 
        КонецЕсли; 
        
        ПроцентВыполнения = (ТекДок/КоличествоНайденныхДокументов)*100;
        ПроцентВыполнения = Окр(ПроцентВыполнения,0);
        ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(ВыборкаДетальныеЗаписи.Ссылка));
        ТекДок = ТекДок + 1;
        
    КонецЦикла;
    
КонецПроцедуры 
//}}ВКМ. Длительная операция


