
//{{ВКМ_Добавляем команду ВКМ_ЗаполнитьСписокДоговоров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда = Команды.Добавить("ВКМ_ЗаполнитьСписокДоговоров");
	Команда.Заголовок = "Заполнить список договоров за период";
	Команда.Действие = "ВКМ_ЗаполнитьСписокДоговоров";
	
	КнопкаФормы = Элементы.Добавить("ВКМ_ЗаполнитьСписокДоговоров", Тип("КнопкаФормы"), Элементы.ВКМ_ГруппаСписокДоговоров);
	КнопкаФормы.ИмяКоманды = "ВКМ_ЗаполнитьСписокДоговоров";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка
	
КонецПроцедуры 
//}}ВКМ

//{{ВКМ. Команда "ВКМ_ЗаполнитьСписокДоговоров"
&НаКлиенте
Процедура ВКМ_ЗаполнитьСписокДоговоров(Команда)
    
    Если Строка(ВКМ_Период.ДатаНачала) = "01.01.0001 0:00:00" И Строка(ВКМ_Период.ДатаОкончания) = "01.01.0001 0:00:00" Тогда 
        ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран период для формирования списка договоров.");
    Иначе 
        //{{ВКМ. Длительная операция
        ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
        ПараметрыОжидания.Интервал = 1;
        ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина; 
        ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере();
        ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
        ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
        //}}ВКМ. Длительная операция
        ВКМ_ЗапросДоговоровНаСервере();
    КонецЕсли;
    
КонецПроцедуры    
//}}ВКМ     

//{{ВКМ. Длительная операция
&НаКлиенте 
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
    ОбщегоНазначенияКлиент.СообщитьПользователю("Завершен процесс формирования и проведения реализаций.
   |Откройте раздел ""Реализация товаров и услуг"".");
КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере()
    ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
    ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(,"Обработка.ВКМ_МассовоеСозданиеАктов.МодульОбъекта.ВыполнитьТяжелыйКод", ВКМ_Период.ДатаНачала, ВидДоговора);	
    Возврат ДлительнаяОперация;
КонецФункции 
//}}ВКМ. Длительная операция 


//{{ВКМ. Запрос договоров абонентского обуслуживания за указанный период на сервере
&НаСервере
Процедура ВКМ_ЗапросДоговоровНаСервере() Экспорт 
    
    ДатаНачала = ВКМ_Период.ДатаНачала; 
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ДоговорыКонтрагентов.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |   ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
    |   И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ВКМ_НачалоДействияДоговора
    |   И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ВКМ_НачалоДействияДоговора";
    
    ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
    
    Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
    Запрос.УстановитьПараметр("ВКМ_НачалоДействияДоговора", ДатаНачала);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        ОбщегоНазначения.СообщитьПользователю("За указанный период нет договоров абонентского обслуживания.");
        Возврат;
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
    Объект.ВКМ_ДоговорыАбонентскогоОбслуживания.Очистить();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        СтрокаТабЧасти = Объект.ВКМ_ДоговорыАбонентскогоОбслуживания.Добавить(); 
        СтрокаТабЧасти.ВКМ_СписокДоговоровАбонентскогоОбслуживания = ВыборкаДетальныеЗаписи.Ссылка;
        
        ДокументРеализация = Документы.РеализацияТоваровУслуг.НайтиПоРеквизиту("Договор", ВыборкаДетальныеЗаписи.Ссылка);
        СтрокаТабЧасти.ВКМ_СсылкиНаРеализации = ДокументРеализация.Ссылка;  
    КонецЦикла; 
    
КонецПроцедуры 
//}}ВКМ

